Revit 2027 API
ParameterTypeId.ViewGraphSunPathSize Property
 "Sun path size (%)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewGraphSunPathSize { get; }
Public Shared ReadOnly Property ViewGraphSunPathSize As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewGraphSunPathSize {
	ForgeTypeId^ get ();
}
static member ViewGraphSunPathSize : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace